–í —Å–≤–æ–µ–π –∫—É—Ä—Å–æ–≤–æ–π  —è –±—ã —Ö–æ—Ç–µ–ª–∞ –ø—Ä–æ—Å–ª–µ–¥–∏—Ç—å –∑–∞–≤–∏—Å–∏–º–æ—Å—Ç—å —É—Ä–æ–≤–Ω—è –∑–ø –æ—Ç —Ä–∞–∑–º–µ—Ä–∞ –∫–æ–º–ø–∞–Ω–∏–∏, —Ä–∞—Å—Å–º–æ—Ç—Ä–µ—Ç—å –∫–∞–∫ –∏–∑–º–µ–Ω–∏–ª–∞—Å—å –∑–∞—Ä–∞–±–æ—Ç–Ω–∞—è –ø–ª–∞—Ç–∞ –≤ –∫–æ–º–ø–∞–Ω–∏—è—Ö —Ä–∞–∑–Ω—ã—Ö —Ä–∞–∑–º–µ—Ä–æ–≤ –∑–∞ –ø–æ—Å–ª–µ–¥–Ω–∏–µ –≥–æ–¥–∞, –æ—Å–Ω–æ–≤—ã–≤–∞—è—Å—å –Ω–∞ –¥–∞–Ω–Ω—ã–µ –∏–∑ –¥–∞—Ç–∞—Å–µ—Ç–∞ –≤ —Å—Å—ã–ª–∫–µ: https://www.kaggle.com/datasets/ruchi798/data-science-job-salaries?resource=download

In [1]:
import numpy as np
import pandas as pd
from matplotlib import pyplot as plt

In [2]:
df = pd.read_csv('/Users/daralobzova/Downloads/ds_salaries.csv')

In [3]:
df

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L
...,...,...,...,...,...,...,...,...,...,...,...,...
602,602,2022,SE,FT,Data Engineer,154000,USD,154000,US,100,US,M
603,603,2022,SE,FT,Data Engineer,126000,USD,126000,US,100,US,M
604,604,2022,SE,FT,Data Analyst,129000,USD,129000,US,0,US,M
605,605,2022,SE,FT,Data Analyst,150000,USD,150000,US,100,US,M
606,606,2022,MI,FT,AI Scientist,200000,USD,200000,IN,100,US,L

—Å—Ç–æ–ª–±—Ü—ã –≤ –¥–∞—Ç–∞—Å–µ—Ç–µ:<br>
work_year - —Ä–∞–±–æ—á–∏–π –≥–æ–¥ <br>
experience_level - –æ–ø—ã—Ç —Ä–∞–±–æ—Ç—ã <br>
employment_type - —Ç–∏–ø –∑–∞–Ω—è—Ç–æ—Å—Ç–∏ <br>
job_title - –¥–æ–ª–∂–Ω–æ—Å—Ç—å <br>
salary - —Ä–∞–∑–º–µ—Ä –∑–∞—Ä–æ–±–æ—Ç–Ω–æ–π –ø–ª–∞—Ç—ã <br>
salary_currency - –≤–∞–ª—é—Ç–∞ –∑/–ø <br>
salary_in_usd - –∑/–ø –≤ –¥–æ–ª–ª–∞—Ä–∞—Ö –°–®–ê <br>
employee_residence - –º–µ—Å—Ç–æ –∂–∏—Ç–µ–ª—å—Å—Ç–≤–∞ —Å–æ—Ç—Ä—É–¥–Ω–∏–∫–∞ <br>
remote_ratio - –¥–∏—Å—Ç–∞–Ω—Ü–∏–æ–Ω–Ω–æ–µ —Å–æ–æ—Ç–Ω–æ—à–µ–Ω–∏–µ <br>
company_location - –º–µ—Å—Ç–æ –Ω–∞—Ö–æ–∂–¥–µ–Ω–∏—è –∫–æ–º–ø–∞–Ω–∏–∏ <br>
company_size - —Ä–∞–∑–º–µ—Ä –∫–æ–º–ø–∞–Ω–∏–∏ <br>

#### 1. –ü—Ä–æ–≤–µ–¥–µ–º –∞–Ω–∞–ª–∏–∑ —É—Ä–æ–≤–Ω—è –∑–∞—Ä–æ–±–æ—Ç–Ω–æ–π –ø–ª–∞—Ç—ã —Å–æ—Ç—Ä—É–¥–Ω–∏–∫–∞ –æ—Ç —Ä–∞–∑–º–µ—Ä–∞ –∫–æ–º–ø–∞–Ω–∏–∏. –ó–∞ –æ—Å–Ω–æ–≤—É –≤–æ–∑—å–º–µ–º —É—Ä–æ–≤–µ–Ω—å –∑–∞—Ä–∞–±–æ—Ç–Ω–æ–π –ø–ª–∞—Ç—ã –≤ –¥–æ–ª–ª–∞—Ä–∞—Ö –°–®–ê.

In [4]:
sample1 = df[['salary_in_usd', 'company_size']]
sample1

     salary_in_usd company_size
0            79833            L
1           260000            S
2           109024            M
3            20000            S
4           150000            L
..             ...          ...
602         154000            M
603         126000            M
604         129000            M
605         150000            M
606         200000            L

[607 rows x 2 columns]

In [5]:
sample1['company_size'].value_counts()

M    326
L    198
S     83
Name: company_size, dtype: int64

–ö–æ–º–ø–∞–Ω–∏–∏ –≤ –¥–∞—Ç–∞—Ñ—Ä–µ–π–º–µ —Ä–∞–∑–¥–µ–ª–µ–Ω—ã –Ω–∞ S (–º–µ–Ω—å—à–µ 50 —Å–æ—Ç—Ä—É–¥–Ω–∏–∫–æ–≤), M (–æ—Ç 50 –¥–æ 250 —Å–æ—Ç—Ä—É–¥–Ω–∏–∫–æ–≤), L (–±–æ–ª—å—à–µ 250 —Å–æ—Ç—Ä—É–¥–Ω–∏–∫–æ–≤). <br> –†–∞–∑–æ–±—å–µ–º –∑–∞—Ä–ø–ª–∞—Ç—ã —Å–æ—Ç—Ä—É–¥–Ω–∏–∫–æ–≤ –ø–æ —Ä–∞–∑–º–µ—Ä–∞–º –∫–æ–º–ø–∞–Ω–∏–π.

In [6]:
S = sample1[sample1['company_size'] == 'S']
S

     salary_in_usd company_size
1           260000            S
3            20000            S
6           190000            S
9           125000            S
10           51321            S
..             ...          ...
510         150000            S
512          65000            S
513          71444            S
515          48000            S
522          20000            S

[83 rows x 2 columns]

In [7]:
S = S.drop(columns='company_size') 
S

     salary_in_usd
1           260000
3            20000
6           190000
9           125000
10           51321
..             ...
510         150000
512          65000
513          71444
515          48000
522          20000

[83 rows x 1 columns]

In [8]:
S.median()

salary_in_usd    65000.0
dtype: float64

In [9]:
M = sample1[sample1['company_size'] == 'M']
M

     salary_in_usd company_size
2           109024            M
12           39916            M
18            5707            M
19           56000            M
20           43331            M
..             ...          ...
601          52000            M
602         154000            M
603         126000            M
604         129000            M
605         150000            M

[326 rows x 2 columns]

In [10]:
M = M.drop(columns='company_size') 
M

     salary_in_usd
2           109024
12           39916
18            5707
19           56000
20           43331
..             ...
601          52000
602         154000
603         126000
604         129000
605         150000

[326 rows x 1 columns]

In [11]:
M.median()

salary_in_usd    113188.0
dtype: float64

In [12]:
L = sample1[sample1['company_size'] == 'L']
L

     salary_in_usd company_size
0            79833            L
4           150000            L
5            72000            L
7            35735            L
8           135000            L
..             ...          ...
524         135000            L
525         177000            L
550         205300            L
551         140400            L
606         200000            L

[198 rows x 2 columns]

In [13]:
L = L.drop(columns='company_size') 
L

     salary_in_usd
0            79833
4           150000
5            72000
7            35735
8           135000
..             ...
524         135000
525         177000
550         205300
551         140400
606         200000

[198 rows x 1 columns]

In [14]:
L.median()

salary_in_usd    100000.0
dtype: float64

In [15]:
S = np.array(S, dtype=np.float64)
M = np.array(M, dtype=np.float64)
L = np.array(L, dtype=np.float64)

In [16]:
n1 = S.shape[0]
n2 = M.shape[0]
n3 = L.shape[0]

–ù–∞–π–¥–µ–º —Å—Ä–µ–¥–Ω—é—é –∑/–ø –ø–æ –∫—Ä–∏—Ç–µ—Ä–∏—é —Ä–∞–∑–º–µ—Ä–∞ –∫–æ–º–ø–∞–Ω–∏–∏:

In [17]:
y1_mean = S.mean()
y2_mean = M.mean()
y3_mean = L.mean()

y1_mean, y2_mean, y3_mean

(77632.67469879518, 116905.46625766871, 119242.99494949495)

–°–æ–±–µ—Ä—ë–º –≤—Å–µ –∑–Ω–∞—á–µ–Ω–∏—è –∑–∞—Ä–∞–±–æ—Ç–Ω—ã—Ö –ø–ª–∞—Ç –≤ –æ–¥–∏–Ω –º–∞—Å—Å–∏–≤:

In [18]:
y = np.concatenate([S, M, L])

–û–±—â–∞—è —Å—Ä–µ–¥–Ω—è—è –∑–∞—Ä–ø–ª–∞—Ç:

In [19]:
y_mean = y.mean()
y_mean

112297.86985172982

–ù–∞–π–¥—ë–º –∑–Ω–∞—á–µ–Ω–∏—è ùëÜùêπ –∏ ùëÜùëüùëíùë†:

In [20]:
S2_F = n1 * (y1_mean - y_mean) ** 2 + n2 * (y2_mean - y_mean) ** 2 + n3 * (y3_mean - y_mean) ** 2

S2_res = ((S - y1_mean) ** 2).sum() + ((M - y2_mean) ** 2).sum() + ((L - y3_mean) ** 2).sum()

S2_F, S2_res

(116210532616.37767, 2934958661268.341)

–ü—Ä–æ–≤–µ—Ä–∏–º –≤—ã–ø–æ–ª–Ω–µ–Ω–∏–µ —Ä–∞–≤–µ–Ω—Å—Ç–≤–∞ ùëÜ2=ùëÜ2ùêπ+ùëÜ2ùëüùëíùë†:

In [21]:
((y - y_mean) ** 2).sum()

3051169193884.718

In [22]:
116210532616.377 + 2934958661268.341

3051169193884.718

—Ä–∞–≤–µ–Ω—Å—Ç–≤–æ –≤—ã–ø–æ–ª–Ω—è–µ—Ç—Å—è

–ó–∞–ø–∏—à–µ–º –æ—Ü–µ–Ω–∫–∏ –¥–∏—Å–ø–µ—Ä—Å–∏–π:

In [23]:
k = 3
n = n1 + n2 + n3

k1 = k - 1
k2 = n - k

sigma2_F = S2_F / k1
sigma2_res = S2_res / k2

sigma2_F, sigma2_res

(58105266308.188835, 4859203081.570101)

–ó–Ω–∞—á–µ–Ω–∏–µ —Å—Ç–∞—Ç–∏—Å—Ç–∏–∫–∏  ùëá :

In [24]:
T = sigma2_F / sigma2_res
T

11.957776889088965

–ó–∞—Ñ–∏–∫—Å–∏—Ä—É–µ–º —É—Ä–æ–≤–µ–Ω—å –∑–Ω–∞—á–∏–º–æ—Å—Ç–∏ ùõº=0.05 . –î–ª—è –Ω–µ–≥–æ –Ω–∞–π–¥—ë–º –∫—Ä–∏—Ç–∏—á–µ—Å–∫–æ–µ –∑–Ω–∞—á–µ–Ω–∏–µ ùêπùëêùëüùëñùë° :

In [25]:
from scipy import stats

In [26]:
alpha = 0.05

F_crit = stats.f.ppf(1 - alpha, k1, k2)
F_crit

3.0106398230773244

–í–∏–¥–∏–º, —á—Ç–æ ùëá>ùêπùëêùëüùëñùë° , –ø–æ—ç—Ç–æ–º—É –∑–∞–∫–ª—é—á–∞–µ–º, —á—Ç–æ —Ä–∞–∑–º–µ—Ä –∫–æ–º–ø–∞–Ω–∏–∏ –≤–ª–∏—è–µ—Ç –Ω–∞ –∑–∞—Ä–∞–±–æ—Ç–Ω—É—é –ø–ª–∞—Ç—É —Å–æ—Ç—Ä—É–¥–Ω–∏–∫–∞. <br>
–í—ã–≤–æ–¥: M–æ–∂–Ω–æ –∑–∞–º–µ—Ç–∏—Ç—å —Ç–µ–Ω–¥–µ–Ω—Ü–∏—é –∏–∑ –ø–æ—Å—á–∏—Ç–∞–Ω–Ω—ã–º –º–µ–¥–∏–∞–Ω–∞–º –∏ —Å—Ä–µ–¥–Ω–∏–º: –≤ –∫–æ–º–ø–∞–Ω–∏—è—Ö –∫–ª–∞—Å—Å–∞ S —Å–∞–º—ã–µ –º–∞–ª–µ–Ω—å–∫–∏–µ –∑–∞—Ä–ø–ª–∞—Ç—ã, –≤ –∫–æ–º–ø–∞–Ω–∏—è—Ö M —Å—Ä–µ–¥–Ω–∏–π —É—Ä–æ–≤–µ–Ω—å –∑–∞—Ä–ø–ª–∞—Ç –≤—ã—à–µ, —á–µ–º —É S –∏ –Ω–∏–∂–µ, —á–µ–º —É L, –æ–¥–Ω–∞–∫–æ –º–µ–¥–∏–∞–Ω–∞ —É M –±–æ–ª—å—à–µ, —á–µ–º —É L, —á—Ç–æ –≥–æ–≤–æ—Ä–∏—Ç –æ —Ç–æ–º, —á—Ç–æ –±–æ–ª–µ–µ –≤—ã—Å–æ–∫–∏—Ö –∑–∞—Ä–ø–ª–∞—Ç —Ç–∞–º –±–æ–ª—å—à–µ –≤ –∫—Ä—É–ø–Ω—ã—Ö –∫–æ–º–ø–∞–Ω–∏—è—Ö.

#### 2. –†–∞—Å—Å–º–æ—Ç—Ä–∏–º, –∫–∞–∫ –∏–∑–º–µ–Ω–∏–ª–∞—Å—å –∑–∞—Ä–∞–±–æ—Ç–Ω–∞—è –ø–ª–∞—Ç–∞ –≤ –∫–æ–º–ø–∞–Ω–∏—è—Ö —Ä–∞–∑–Ω—ã—Ö —Ä–∞–∑–º–µ—Ä–æ–≤ –∑–∞ –ø–æ—Å–ª–µ–¥–Ω–∏–µ –≥–æ–¥–∞. –ó–∞ –æ—Å–Ω–æ–≤—É –≤–æ–∑—å–º–µ–º –¥–∞–Ω–Ω—ã–µ –æ –∑/–ø –≤ –¥–æ–ª–ª–∞—Ä–∞—Ö –°–®–ê

In [27]:
sample2 = df[['salary_in_usd', 'company_size', 'work_year']]
sample2

     salary_in_usd company_size  work_year
0            79833            L       2020
1           260000            S       2020
2           109024            M       2020
3            20000            S       2020
4           150000            L       2020
..             ...          ...        ...
602         154000            M       2022
603         126000            M       2022
604         129000            M       2022
605         150000            M       2022
606         200000            L       2022

[607 rows x 3 columns]

In [28]:
sample2['work_year'].value_counts()

2022    318
2021    217
2020     72
Name: work_year, dtype: int64

–í —Ä–∞—Å—Å–º–∞—Ç—Ä–∏–≤–∞–µ–º–æ–º –¥–∞—Ç–∞—Å–µ—Ç–µ –µ—Å—Ç—å –∏–Ω—Ñ–æ—Ä–º–∞—Ü–∏—è —Ç–æ–ª—å–∫–æ –æ 3—Ö –≥–æ–¥–∞—Ö: 2020, 2021 –∏ 2022.

In [40]:
# —Ä–∞—Å—Å–º–æ—Ç—Ä–∏–º –¥–∞–Ω–Ω—ã–µ 3—Ö –ª–µ—Ç –¥–ª—è –∫–æ–º–ø–∞–Ω–∏–π S:
S2 = sample2[sample2['company_size'] == 'S']
S2

     salary_in_usd company_size  work_year
1           260000            S       2020
3            20000            S       2020
6           190000            S       2020
9           125000            S       2020
10           51321            S       2020
..             ...          ...        ...
510         150000            S       2022
512          65000            S       2022
513          71444            S       2022
515          48000            S       2022
522          20000            S       2022

[83 rows x 3 columns]

In [41]:
S2 = S2.drop(columns='company_size') 
S2

     salary_in_usd  work_year
1           260000       2020
3            20000       2020
6           190000       2020
9           125000       2020
10           51321       2020
..             ...        ...
510         150000       2022
512          65000       2022
513          71444       2022
515          48000       2022
522          20000       2022

[83 rows x 2 columns]

In [59]:
#–¥–∞–Ω–Ω—ã–µ –¥–ª—è 2020 –≥–æ–¥–∞ –¥–ª—è –∫–æ–º–ø–∞–Ω–∏–∏ S:
S2020 = S2[S2['work_year'] == 2020]

In [49]:
Smean2020 = S2020.mean()
Smean2020

salary_in_usd    70958.56
work_year         2020.00
dtype: float64

In [47]:
Smean2020.median()

36489.28

In [51]:
#–¥–∞–Ω–Ω—ã–µ –¥–ª—è 2021 –≥–æ–¥–∞ –¥–ª—è –∫–æ–º–ø–∞–Ω–∏–∏ S:
S2021 = S2[S2['work_year'] == 2021]

In [54]:
Smean2021 = S2021.mean()
Smean2021

salary_in_usd    81509.844444
work_year         2021.000000
dtype: float64

In [55]:
Smean2021.median()

41765.42222222222

In [56]:
#–¥–∞–Ω–Ω—ã–µ –¥–ª—è 2022 –≥–æ–¥–∞ –¥–ª—è –∫–æ–º–ø–∞–Ω–∏–∏ S:
S2022 = S2[S2['work_year'] == 2022]

In [57]:
Smean2022 = S2022.mean()
Smean2022

salary_in_usd    77046.538462
work_year         2022.000000
dtype: float64

In [58]:
Smean2022.median()

39534.269230769234

–î–ª—è –∫–æ–º–ø–∞–Ω–∏–π S –ø—Ä–æ–∏–∑–æ—à–µ–ª —Å–ª–µ–¥—É—é—â–∏–π —Å–¥–≤–∏–≥: <br>
    –≤ 2021 –≥–æ–¥—É –∑–∞—Ä–∞–±–æ—Ç–Ω–∞—è –ø–ª–∞—Ç–∞ –±—ã–ª–∞ –≤—ã—à–µ, —á–µ–º –≤ 2—Ö –¥—Ä—É–≥–∏—Ö —Ä–∞—Å—Å–º–æ—Ç—Ä–µ–Ω–Ω—ã—Ö –≥–æ–¥–∞—Ö <br>
    –≤ 2022 –≥–æ–¥—É –∑/–ø –±—ã–ª–∞ –Ω–∏–∂–µ, —á–µ–º –≤ 2021, –Ω–æ –≤—ã—à–µ, —á–µ–º –≤ 2020 <br>
–ú–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –ø—Ä–µ–¥–ø–æ–ª–æ–∂–µ–Ω–∏–µ, —á—Ç–æ —É—Ä–æ–≤–µ–Ω—å –∑/–ø –¥–ª—è –º–∞–ª–µ–Ω—å–∫–∏—Ö –∫–æ–º–ø–∞–Ω–∏–π –Ω–µ —Å–∏–ª—å–Ω–æ –≤–ª–∏—è–µ—Ç –Ω–∞ –≥–æ–¥, —Å–∫–æ—Ä–µ–π –≤—Å–µ–≥–æ –Ω–∞ –ø–æ–∫–∞–∑–∞—Ç–µ–ª—å —É—Ä–æ–≤–Ω—è –∑/–ø –≤–ª–∏—è–µ—Ç –∫–∞–∫–æ–π-—Ç–æ –¥—Ä—É–≥–æ–π –±–æ–ª–µ–µ —Å–∏–ª—å–Ω—ã–π –ø–æ–∫–∞–∑–∞—Ç–µ–ª—å (–Ω–∞–ø—Ä–∏–º–µ—Ä, –∫—É—Ä—Å –≤–∞–ª—é—Ç—ã –ø–æ –æ—Ç–Ω–æ—à–µ–Ω–∏—é –∫ –¥–æ–ª–ª–∞—Ä—É). <br>
2021>2022>2020

In [61]:
# —Ä–∞—Å—Å–º–æ—Ç—Ä–∏–º –¥–∞–Ω–Ω—ã–µ 3—Ö –ª–µ—Ç –¥–ª—è –∫–æ–º–ø–∞–Ω–∏–π M:
M2 = sample2[sample2['company_size'] == 'M']
M2

     salary_in_usd company_size  work_year
2           109024            M       2020
12           39916            M       2020
18            5707            M       2020
19           56000            M       2020
20           43331            M       2020
..             ...          ...        ...
601          52000            M       2022
602         154000            M       2022
603         126000            M       2022
604         129000            M       2022
605         150000            M       2022

[326 rows x 3 columns]

In [62]:
M2 = M2.drop(columns='company_size') 
M2

     salary_in_usd  work_year
2           109024       2020
12           39916       2020
18            5707       2020
19           56000       2020
20           43331       2020
..             ...        ...
601          52000       2022
602         154000       2022
603         126000       2022
604         129000       2022
605         150000       2022

[326 rows x 2 columns]

In [63]:
#–¥–∞–Ω–Ω—ã–µ –¥–ª—è 2020 –≥–æ–¥–∞ –¥–ª—è –∫–æ–º–ø–∞–Ω–∏–∏ M:
M2020 = M2[M2['work_year'] == 2020]

In [64]:
Mmean2020 = M2020.mean()
Mmean2020

salary_in_usd    115467.5
work_year          2020.0
dtype: float64

In [65]:
Mmean2020.median()

58743.75

In [66]:
#–¥–∞–Ω–Ω—ã–µ –¥–ª—è 2021 –≥–æ–¥–∞ –¥–ª—è –∫–æ–º–ø–∞–Ω–∏–∏ M:
M2021 = M2[M2['work_year'] == 2021]

In [67]:
Mmean2021 = M2021.mean()
Mmean2021

salary_in_usd    74154.792453
work_year         2021.000000
dtype: float64

In [68]:
Mmean2021.median()

38087.8962264151

In [69]:
#–¥–∞–Ω–Ω—ã–µ –¥–ª—è 2022 –≥–æ–¥–∞ –¥–ª—è –∫–æ–º–ø–∞–Ω–∏–∏ M:
M2022 = M2[M2['work_year'] == 2022]

In [70]:
Mmean2022 = M2022.mean()
Mmean2022

salary_in_usd    125731.401544
work_year          2022.000000
dtype: float64

In [71]:
Mmean2022.median()

63876.70077220077

–î–ª—è –∫–æ–º–ø–∞–Ω–∏–π M –ø—Ä–æ–∏–∑–æ—à–µ–ª —Å–ª–µ–¥—É—é—â–∏–π —Å–¥–≤–∏–≥: <br>
–≤ 2022 –≥–æ–¥—É –∑–∞—Ä–∞–±–æ—Ç–Ω–∞—è –ø–ª–∞—Ç–∞ –±—ã–ª–∞ –≤—ã—à–µ, —á–µ–º –≤ 2—Ö –¥—Ä—É–≥–∏—Ö —Ä–∞—Å—Å–º–æ—Ç—Ä–µ–Ω–Ω—ã—Ö –≥–æ–¥–∞—Ö<br>
–≤ 2020 –≥–æ–¥—É –∑/–ø –±—ã–ª–∞ –Ω–∏–∂–µ, —á–µ–º –≤ 2022, –Ω–æ –≤—ã—à–µ, —á–µ–º –≤ 2021<br>
–ú–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –ø—Ä–µ–¥–ø–æ–ª–æ–∂–µ–Ω–∏–µ, —á—Ç–æ —É—Ä–æ–≤–µ–Ω—å –∑/–ø –¥–ª—è –º–∞–ª–µ–Ω—å–∫–∏—Ö –∫–æ–º–ø–∞–Ω–∏–π –Ω–µ —Å–∏–ª—å–Ω–æ –≤–ª–∏—è–µ—Ç –Ω–∞ –≥–æ–¥, —Å–∫–æ—Ä–µ–π –≤—Å–µ–≥–æ –Ω–∞ –ø–æ–∫–∞–∑–∞—Ç–µ–ª—å —É—Ä–æ–≤–Ω—è –∑/–ø –≤–ª–∏—è–µ—Ç –∫–∞–∫–æ–π-—Ç–æ –¥—Ä—É–≥–æ–π –±–æ–ª–µ–µ —Å–∏–ª—å–Ω—ã–π –ø–æ–∫–∞–∑–∞—Ç–µ–ª—å (–Ω–∞–ø—Ä–∏–º–µ—Ä, –∫—É—Ä—Å –≤–∞–ª—é—Ç—ã –ø–æ –æ—Ç–Ω–æ—à–µ–Ω–∏—é –∫ –¥–æ–ª–ª–∞—Ä—É).<br>
2022>2020>2021

In [72]:
# —Ä–∞—Å—Å–º–æ—Ç—Ä–∏–º –¥–∞–Ω–Ω—ã–µ 3—Ö –ª–µ—Ç –¥–ª—è –∫–æ–º–ø–∞–Ω–∏–π L:
L2 = sample2[sample2['company_size'] == 'L']
L2

     salary_in_usd company_size  work_year
0            79833            L       2020
4           150000            L       2020
5            72000            L       2020
7            35735            L       2020
8           135000            L       2020
..             ...          ...        ...
524         135000            L       2022
525         177000            L       2022
550         205300            L       2022
551         140400            L       2022
606         200000            L       2022

[198 rows x 3 columns]

In [73]:
L2 = L2.drop(columns='company_size') 
L2

     salary_in_usd  work_year
0            79833       2020
4           150000       2020
5            72000       2020
7            35735       2020
8           135000       2020
..             ...        ...
524         135000       2022
525         177000       2022
550         205300       2022
551         140400       2022
606         200000       2022

[198 rows x 2 columns]

In [74]:
#–¥–∞–Ω–Ω—ã–µ –¥–ª—è 2020 –≥–æ–¥–∞ –¥–ª—è –∫–æ–º–ø–∞–Ω–∏–∏ L:
L2020 = L2[L2['work_year'] == 2020]

In [75]:
Lmean2020 = L2020.mean()
Lmean2020

salary_in_usd    106303.848485
work_year          2020.000000
dtype: float64

In [76]:
Lmean2020.median()

54161.92424242424

In [77]:
#–¥–∞–Ω–Ω—ã–µ –¥–ª—è 2021 –≥–æ–¥–∞ –¥–ª—è –∫–æ–º–ø–∞–Ω–∏–∏ L:
L2021 = L2[L2['work_year'] == 2021]

In [78]:
Lmean2021 = L2021.mean()
Lmean2021

salary_in_usd    118236.352941
work_year          2021.000000
dtype: float64

In [79]:
Lmean2021.median()

60128.67647058824

In [80]:
#–¥–∞–Ω–Ω—ã–µ –¥–ª—è 2022 –≥–æ–¥–∞ –¥–ª—è –∫–æ–º–ø–∞–Ω–∏–∏ L:
L2022 = L2[L2['work_year'] == 2022]

In [81]:
Lmean2022 = L2022.mean()
Lmean2022

salary_in_usd    131129.565217
work_year          2022.000000
dtype: float64

In [82]:
Lmean2022.median()

66575.78260869565

–î–ª—è –∫–æ–º–ø–∞–Ω–∏–π L –ø—Ä–æ–∏–∑–æ—à–µ–ª —Å–ª–µ–¥—É—é—â–∏–π —Å–¥–≤–∏–≥: <br>
–≤ 2022 –≥–æ–¥—É –∑–∞—Ä–∞–±–æ—Ç–Ω–∞—è –ø–ª–∞—Ç–∞ –±—ã–ª–∞ –≤—ã—à–µ, —á–µ–º –≤ 2—Ö –¥—Ä—É–≥–∏—Ö —Ä–∞—Å—Å–º–∞—Ç—Ä–∏–≤–∞–µ–º—ã—Ö –≥–æ–¥–∞—Ö<br>
–≤ 2021 –≥–æ–¥—É –∑/–ø –±—ã–ª–∞  –≤—ã—à–µ, —á–µ–º –≤ 2020<br>
–î–ª—è –∫–æ–º–ø–∞–Ω–∏–π —ç—Ç–æ–π –≥—Ä—É–ø–ø—ã –ø—Ä–æ—Å–ª–µ–∂–∏–≤–∞–µ—Ç—Å—è —Ç–µ–Ω–¥–µ–Ω—Ü–∏—è —Ä–æ—Å—Ç–∞ –∑/–ø –æ—Ç –≥–æ–¥–∞ –æ—Ç—Å–ª–µ–∂–∏–≤–∞–Ω–∏—è - —á–µ–º –±–æ–ª—å—à–µ –≥–æ–¥, —Ç–µ–º –±–æ–ª—å—à–µ –∑/–ø .<br>
2022>2021>2020

–í—ã–≤–æ–¥: –º–æ–∂–Ω–æ —Å–∫–∞–∑–∞—Ç—å, —á—Ç–æ –¥–∞–Ω–Ω—ã–π –ø—Ä–∏–∑–Ω–∞–∫ –∏–º–µ–µ—Ç —Ä–∞–∑–Ω—ã–π –∫–æ—ç—Ñ—Ñ–∏—Ü–∏–µ–Ω—Ç –≤–ª–∏—è–Ω–∏—è –Ω–∞ –∫–∞–∂–¥—É—é –∏–∑ –≥—Ä—É–ø–ø –∫–æ–º–ø–∞–Ω–∏–π.